Конфигурация/DataProcessors/ЦВ_ПерегенерацияНаименований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ЦВ_ПерегенерацияНаименований</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСодержит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Строки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БылоУкр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СталоУкр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БылоРус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СталоРус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменилось</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предупреждения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/DataProcessors/ЦВ_ПерегенерацияНаименований/Forms/Форма/Ext/Form/Module.bsl
// Форма пакетной перегенерации наименований.
//
// Логика целиком в модуле объекта обработки и в модуле менеджера Справочники.Номенклатура -
// здесь только переключение клиент/сервер, чтобы кнопка была одной строкой.

&НаКлиенте
Процедура ЗаполнитьПредпросмотр(Команда)

	ЗаполнитьПредпросмотрНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредпросмотрНаСервере()

	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ЗаполнитьПредпросмотр();
	ЗначениеВРеквизитФормы(Обработка, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОтмеченные(Команда)

	Ответ = Вопрос("Записати позначені позиції?", РежимДиалогаВопрос.ДаНет);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	ЗаписатьОтмеченныеНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаписатьОтмеченныеНаСервере()

	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ЗаписатьОтмеченные();
	ЗначениеВРеквизитФормы(Обработка, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ОткатитьОтмеченные(Команда)

	Ответ = Вопрос("Повернути позначеним позиціям попередні найменування з історії?", РежимДиалогаВопрос.ДаНет);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	ОткатитьОтмеченныеНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОткатитьОтмеченныеНаСервере()

	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ОткатитьОтмеченные();
	ЗначениеВРеквизитФормы(Обработка, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтмеченныеНаСайт(Команда)

	ВыгрузитьОтмеченныеНаСайтНаСервере();

КонецПроцедуры

&НаСервере
Процедура ВыгрузитьОтмеченныеНаСайтНаСервере()

	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ВыгрузитьОтмеченныеНаСайт();

КонецПроцедуры

// Пометки меняются на клиенте: гонять всю таблицу на сервер ради галочек незачем.

&НаКлиенте
Процедура ОтметитьВсе(Команда)

	УстановитьПометки(Истина);

КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)

	УстановитьПометки(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Значение)

	Для Каждого СтрокаТаблицы Из Объект.Строки Цикл
		// Отмечать нечего там, где запись всё равно ничего не сделает.
		СтрокаТаблицы.Пометка = Значение И СтрокаТаблицы.Изменилось;
	КонецЦикла;

КонецПроцедуры

// Пошаговый разбор шаблона для текущей строки: что подставилось в токены,
// какое поле выброшено и почему. Ничего не меняет.

&НаКлиенте
Процедура Диагностика(Команда)

	ТекущиеДанные = Элементы.Строки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Предупреждение("Станьте на рядок таблиці.");
		Возврат;
	КонецЕсли;

	ТекстДокумента = Новый ТекстовыйДокумент;
	ТекстДокумента.УстановитьТекст(ТекстДиагностики(ТекущиеДанные.Номенклатура));
	ТекстДокумента.Показать("Діагностика найменування");

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстДиагностики(СсылкаНоменклатуры)

	Возврат Справочники.Номенклатура.ДиагностикаНаименования(СсылкаНоменклатуры);

КонецФункции

// Выгрузка перегляду текстом через табуляцію: вставляється прямо в Excel.
// Табличная часть формы доступна на клиенте, сервер тут не нужен.

&НаКлиенте
Процедура ВыгрузитьПредпросмотр(Команда)

	Если Объект.Строки.Количество() = 0 Тогда
		Предупреждение("Спочатку заповніть перегляд.");
		Возврат;
	КонецЕсли;

	ТекстДокумента = Новый ТекстовыйДокумент;
	ТекстДокумента.ДобавитьСтроку("Вид" + Символы.Таб + "Код" + Символы.Таб + "Було (укр)" + Символы.Таб + "Стало (укр)"
		+ Символы.Таб + "Було (рус)" + Символы.Таб + "Стало (рус)" + Символы.Таб + "Попередження");

	Для Каждого СтрокаТаблицы Из Объект.Строки Цикл
		ТекстДокумента.ДобавитьСтроку(Строка(СтрокаТаблицы.ВидНоменклатуры) + Символы.Таб + СокрЛП(СтрокаТаблицы.Код)
			+ Символы.Таб + СтрокаТаблицы.БылоУкр
			+ Символы.Таб + СтрокаТаблицы.СталоУкр
			+ Символы.Таб + СтрокаТаблицы.БылоРус
			+ Символы.Таб + СтрокаТаблицы.СталоРус
			+ Символы.Таб + СтрокаТаблицы.Предупреждения);
	КонецЦикла;

	ТекстДокумента.Показать("Перегляд перейменування");

КонецПроцедуры
